In [1]:
import numpy as np
import pandas as pd

In [22]:
df = pd.read_csv("Nigerian_Car_Prices.csv")
df.head()

,Unnamed: 0,Make,Year of manufacture,Condition,Mileage,Engine Size,Fuel,Transmission,Price,Build
0,0,Toyota,2007.0,Nigerian Used,166418.0,2400.0,Petrol,Automatic,"3,120,000",NaN
1,1,Lexus,NaN,NaN,138024.0,NaN,NaN,Automatic,"5,834,000",NaN
2,2,Mercedes-Benz,2008.0,Nigerian Used,376807.0,3000.0,Petrol,Automatic,"3,640,000",NaN
3,3,Lexus,NaN,NaN,213362.0,NaN,NaN,Automatic,"3,594,000",NaN
4,4,Mercedes-Benz,NaN,NaN,106199.0,NaN,NaN,Automatic,"8,410,000",NaN

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4095 entries, 0 to 4094
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           4095 non-null   int64
 1   Make                 4095 non-null   object
 2   Year of manufacture  3617 non-null   float64
 3   Condition            3616 non-null   object
 4   Mileage              4024 non-null   float64
 5   Engine Size          3584 non-null   float64
 6   Fuel                 3607 non-null   object
 7   Transmission         4075 non-null   object
 8   Price                4095 non-null   object
 9   Build                1127 non-null   object
dtypes: float64(3), int64(1), object(6)
memory usage: 320.0+ KB

In [158]:
df[df.duplicated()]

Empty DataFrame
Columns: [Unnamed: 0, Make, Year of manufacture, Condition, Mileage, Engine Size, Fuel, Transmission, Price, Build]
Index: []

In [29]:
df.isnull().sum()

Unnamed: 0                0
Make                      0
Year of manufacture     478
Condition               479
Mileage                  71
Engine Size             511
Fuel                    488
Transmission             20
Price                     0
Build                  2968
dtype: int64

In [35]:
df['Price'] = df['Price'].astype(object)

In [38]:
df['Price'] = df['Price'].apply(lambda x: x.replace(",","")).astype(float)

In [108]:
#What is the most expensive Automatic car (show car name and model make) with a mileage of less than 5000

df2 = df[df['Mileage'] < 5000]
df3=df2[df2['Transmission'].isin(['Automatic'])]
df3[['Make','Price', 'Mileage', 'Transmission']][df3.Price == df3.Price.max()].reset_index(drop=True)

     Make       Price  Mileage Transmission
0  Nissan  50970000.0     72.0    Automatic
1  Nissan  50970000.0     84.0    Automatic
2  Nissan  50970000.0     84.0    Automatic

In [162]:
#Write a function to bring out the average of each car, which car make has the highest average price? Write a code to show this

df_averages = df.groupby('Make').Price.mean().reset_index()
df_averages[df_averages.Price == df_averages.Price.max()]

    Make       Price
45  Tata  17850000.0

In [157]:
#Select the row with a price at the 76th percentile score

df[df.Price == np.percentile(df.Price, 76)]

,Unnamed: 0,Make,Year of manufacture,Condition,Mileage,Engine Size,Fuel,Transmission,Price,Build
576,576,Buick,NaN,NaN,55388.0,NaN,NaN,Automatic,4770000.0,NaN
679,679,Buick,NaN,NaN,55388.0,NaN,NaN,Automatic,4770000.0,NaN